Revit 2026 API

# LogicalAndFilter(ElementFilter, ElementFilter) Constructor

---

Constructs a new instance of the logical filter with two input filters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LogicalAndFilter(
	ElementFilter filter1,
	ElementFilter filter2
)
```
```vb
Public Sub New (
	filter1 As ElementFilter,
	filter2 As ElementFilter
)
```
```cpp
public:
LogicalAndFilter(
	ElementFilter^ filter1,
	ElementFilter^ filter2
)
```
```fsharp
new :
        filter1 : ElementFilter *
        filter2 : ElementFilter -> LogicalAndFilter
```

#### Parameters

filter1 ElementFilter
     The first filter.
filter2 ElementFilter
     The second filter.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The input filters will be copied.

#### Reference

LogicalAndFilter Class

LogicalAndFilter Overload

Autodesk.Revit.DB Namespace